<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Schema;

return new class extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        Schema::create('travel_sims', function (Blueprint $table) {
            $table->id();
            $table->integer('travel_cate_id');
            $table->string('title');
            $table->string('details')->nullable();
            $table->integer('price')->default(0)->comment('ราคาขาย/บาท');
            $table->integer('lifetime')->default(0)->comment('อายุการใช้งาน/วัน');
            $table->string('internet_details')->nullable();
            $table->string('call_credit')->default(0)->comment('เครดิตการโทร/บาท');
            $table->string('call_credit_details')->nullable();
            $table->string('free_call')->nullable()->comment('Free,Unlimited call');
            $table->string('free_call_details')->nullable();
            $table->string('free_tiktok_details')->nullable();

            $table->boolean('unlimited_5g')->default(false);
            $table->boolean('free_wifi')->default(false);
            $table->boolean('free_tiktok')->default(false);
            $table->boolean('free_socials')->default(false);

            $table->string('package_options')->nullable()->comment('ตัวเลือกแพ็คเกจ');
            $table->string('thumbnail_link')->nullable();
            $table->string('thumbnail_title')->nullable();
            $table->string('thumbnail_alt')->nullable();
            $table->text('details_content')->nullable();
            $table->text('terms_content')->nullable()->comment('ข้อกำหนดและเงื่อนไข');
            $table->integer('priority')->nullable();
            $table->boolean('recommended')->default(false);
            $table->boolean('display')->default(true);
            $table->string('benefit_ids')->nullable()->comment('สิทธิประโยชน์');
            $table->boolean('delete_status')->default(false);
            $table->string('language')->default('th');
            $table->unique(['language', 'id']);

            $table->timestamp('created_at')->useCurrent();
            $table->timestamp('updated_at')->useCurrent();
        });
        DB::statement('ALTER TABLE `travel_sims` DROP PRIMARY KEY, ADD PRIMARY KEY (`id`, `language`) USING BTREE');
        DB::table('travel_sims')->insert([
            [
                'travel_cate_id' => 1,
                'title' => 'Thailand Tourist sim',
                'details' => 'Thailand Tourist sim',
                'price' => 299,
                'lifetime' => 10,
                'internet_details' => 'NON-STOP INTERNET for 15GB at 5G/4G MAX SPEED',
                'call_credit' => 100,
                'call_credit_details' => 'for local and international calls',
                'free_call' => 'free',
                'free_call_details' => 'among TrueMove H numbers',
                'free_tiktok_details' => 'Free 10 GB',
                'unlimited_5g' => false,
                'free_wifi' => true,
                'free_tiktok' => true,
                'free_socials' => true,
                'benefit_ids' => '',
                'package_options' => ',299,399,', // package option 1:price, package option 2:price
                'thumbnail_link' => 'images/travel/Rectangle 723.png',
                'thumbnail_title' => '',
                'thumbnail_alt' => '',
                'recommended' => true,
                'priority' => 1,
                'language' => 'th',

                'details_content' => '<p>ซิมเทพ เล่นเน็ตไม่อั้น +โทรฟรีทุกค่าย  ลูกค้าจะได้เล่นเน็ตไม่จำกัด ฟรีเดือนแรก  โปรโมชั่นเครือข่าย True </p>

                                    <p>1. True ความเร็ว 10Mbps (ไม่ลดสปีด) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 210 บาท (รวมภาษีแล้ว) </p>

                                    <p>2. True ความเร็ว 20Mbps (ไม่มีโทรฟรี)  เล่นเน็ตไม่อั้น 70GB (FUP 1Mbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 200 บาท (รวมภาษีแล้ว) </p>

                                    <p>3. True ความเร็ว 15Mbps +โทรฟรีทุกค่าย  เล่นเน็ตไม่อั้น 80GB (FUP 1Mbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 300 บาท (รวมภาษีแล้ว) </p>

                                    <p>4. True ความเร็ว 15Mbps +โทรฟรีทุกค่าย  เล่นเน็ตไม่อั้น 55GB (FUP 1Mbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 250 บาท (รวมภาษีแล้ว)</p>

                                    <p> 5. True ความเร็ว 15Mbps +โทรฟรีทุกค่าย  เล่นเน็ตไม่อั้น 30GB (FUP 384Kbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 200 บาท (รวมภาษีแล้ว)</p>

                                    <p> 6. True ความเร็ว 4Mbps (ไม่มีโทรฟรี)  เล่นเน็ตไม่อั้น 30GB (FUP 1Mbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 150 บาท (รวมภาษีแล้ว) </p>

                                    <p>** ทำไมถึงต้องเลือกทรู ตอบ เล่นได้ทุกแอพ เน็ตไม่มีหมด 8 แอพดังนี้<br />
                                    เล่นโซเชียล Facebook, Line, instagram, TikTok</p>',

                'terms_content' => '<p><strong>ข้อกำหนดและเงื่อนไขรายการส่งเสริมการขาย Fixxy No Limit สำหรับย้ายค่ายแบบรายเดือน</strong></p>

                                        <p>1.รายการส่งเสริมการขายนี้ สำหรับผู้สมัครใช้บริการย้ายค่ายเบอร์เดิมมาใช้ ทรูมูฟ เอช (&ldquo;ผู้ใช้บริการ&rdquo;) ของบริษัท ทรู มูฟ เอช ยูนิเวอร์แซล คอมมิวนิเคชั่น จำกัด (&ldquo;บริษัท&rdquo;) แบบระบบรายเดือน ในนามบุคคลธรรมดา ตั้งแต่วันที่ 22 กันยายน 2566 &nbsp;ถึง 30 พฤศจิกายน 2566 หรือจนกว่าจะมีการเปลี่ยนแปลง</p>

                                        <p>2.รายละเอียดรายการส่งเสริมการขาย: อัตราค่าบริการยังไม่รวมภาษีมูลค่าเพิ่ม</p>

                                        <p>2.1 รายการส่งเสริมการขาย Fixxy No Limit 399<br />
                                        สิทธิตามแพ็กเกจปกติ:<br />
                                        คิดอัตราค่าใช้บริการเหมาจ่ายขั้นต่ำรายเดือน 399 บาท ต่อเดือน ผู้ใช้บริการจะได้รับสิทธิใช้บริการ ดังนี้<br />
                                        (1)โทรทุกเครือข่ายเดือนละ 150 นาทีต่อรอบค่าบริการ&nbsp;<br />
                                        (2)บริการ 5G ที่ความเร็วสูงสุด 20 เมกะบิตต่อวินาที (Mbps) เป็นจำนวน 70 กิกะไบต์ (GB)หลังจากนั้น จะใช้ได้ไม่จำกัดปริมาณที่ความเร็วสูงสุด 1 เมกะบิตต่อวินาที (Mbps)<br />
                                        (3)บริการ Wi-Fi ที่ความเร็วสูงสุด 1 กิกกะบิตต่อวินาที (Gbps) ไม่จำกัดปริมาณการใช้งาน<br />
                                        (4)บริการ Voice Mail และ Miss Call Alert</p>

                                        <p><br />
                                        เงื่อนไขการใช้รายการส่งเสริมการขาย<br />
                                        (1)บริษัทมีสิทธิในการจำกัดการใช้งานเน็ตไม่จำกัดปริมาณการใช้งานตามแพ็กเกจที่ผู้ใช้บริการได้สมัครใช้บริการควบคู่ไปกับเลขหมายโทรศัพท์เคลื่อนที่ และโทรศัพท์เคลื่อนที่ประเภท Smart phone และ Tablet หากบริษัทตรวจพบ หรือมีการแจ้งมายังบริษัท ว่าผู้ใช้บริการ มีการใช้งานในลักษณะของการกระจายสัญญาณโมบายอินเตอร์เน็ตให้กับโทรศัพท์เคลื่อนที่ และ/หรืออุปกรณ์อื่นเพื่อร่วมใช้งานด้วย และ/หรือการกระทำอื่นๆ ในลักษณะเดียวกัน หรือคล้ายคลึงกันทุกกรณี<br />
                                        <br />
                                        (2)บริษัทมีสิทธิในการจัดการบริหารเครือข่ายตามความเหมาะสมเพื่อรักษามาตรฐานคุณภาพของบริการ และเพื่อช่วยให้ผู้ใช้บริการโดยรวมสามารถใช้งานได้อย่างมีประสิทธิภาพ โดยการจำกัดปริมาณการใช้งานของผู้ใช้บริการและความเร็วของโมบายอินเตอร์เน็ตตามความเหมาะสมในรอบบิลถัดไป ในกรณีที่บริษัทพบหรือสันนิษฐานได้ว่าผู้ใช้บริการมีการดาวน์โหลด และ/หรือ อัพโหลดไฟล์ขนาดใหญ่ หรือ การใช้งานใดๆ ที่มีการรับส่งข้อมูลในปริมาณสูงมากอย่างต่อเนื่อง ในลักษณะไม่เป็นปกติดังเช่นบุคคลทั่วไปพึงใช้งาน หรือผู้ใช้บริการมีพฤฒิกรรมการใช้งานที่มีผลต่อการใช้บริการหรือเกิดความไม่เป็นธรรม ก่อหรืออาจก่อให้เกิดความเสียหาย หรือกระทบ หรืออาจจะกระทบต่อการใช้บริการผู้ใช้บริการรายอื่น และ/หรือต่อเครือข่าย หรือการให้บริการโดยรวมของบริษัท ทั้งนี้การลดความเร็วอาจลดต่ำกว่าที่ระบุในแพ็กเกจได้<br />
                                        <br />
                                        (3)บริษัทมีสิทธิ์จำกัดการใช้งานในลักษณะ BitTorrent, การแชร์เน็ตผ่าน Hotspot, การรับส่งไฟล์ระหว่างเครื่องลูกข่ายกับเครื่องลูกข่าย (Peer 2 Peer) เช่น แอปพลิเคชั่นกล้องวงจรปิด, เกมแบบหลายผู้เล่นบางเกม หรือการรับส่งข้อมูลในปริมาณสูงผิดปกติเกินบุคคลทั่วไปพึงใช้งาน หรือมีการใช้งานที่อาจส่งผลกระทบต่อการใช้งานโดยรวม<br />
                                        <br />
                                        เงื่อนไขการใช้บริการ TrueID: สามารถใช้บริการTrueID เฉพาะบริการภายในแอปพลิเคชั่น TrueID บนโทรศัพท์เคลื่อนที่หรือแท๊บเล็ต ในกรณีที่ผู้ใช้บริการใช้ website อื่นหรือลิงค์หรือการแชร์ที่ปรากฏบนหน้าแอปพลิเคชั่นTrueID ผู้ใช้บริการจะต้องชำระค่าใช้บริการเพิ่มเติม (ถ้ามี)ตามอัตราที่ระบุในแพ็กเกจที่ผู้ใช้บริการเลือกใช้งานอยู่ ณ ขณะนั้น หรือหากในแพ็กเกจที่เลือกใช้ ไม่ได้ระบุไว้ ให้คิดค่าบริการตามเงื่อนไขที่บริษัทกำหนด<br />
                                        <br />
                                        บริการที่รวมอยู่ในแพ็กเกจ TrueID ผู้ใช้สามารถใช้งาน login และ logout สามารถใช้บริการดูทีวีสตรีมมิ่ง, หนัง, เพลง, บทความ ผ่านเมนู Exclusive, Movie, TV, Soccer, Music, Sport, Travel, Food, Game, Men, Women และ Entertainment ไม่นับรวมในการใช้งานในเมนู Privileges, Cloud และ Payment<br />
                                        <br />
                                        3. ค่าบริการส่วนเกินเหมาจ่าย คิดเพิ่มเติมจากค่าใช้บริการเหมาจ่ายรายเดือน ในอัตราดังนี้<br />
                                        3.1 โทรทุกเครือข่าย นาทีละ 1.50 บาท คิดค่าบริการเป็นรายนาที เศษของนาทีนับเป็นหนึ่งนาที<br />
                                        3.2 บริการส่งข้อความสั้น (SMS) ระหว่างโทรศัพท์เคลื่อนที่ที่ใช้และจดทะเบียนภายในประเทศ ข้อความละ 2.50 บาท<br />
                                        3.3 บริการส่งข้อความมัลติมีเดีย (MMS) ระหว่างโทรศัพท์เคลื่อนทีที่ใช้และจดทะเบียนภายในประเทศ ครั้งละ 4.50 บาท</p>',
            ],
            [
                'travel_cate_id' => 2,
                'title' => 'Thailand Tourist sim',
                'details' => 'Thailand Tourist sim',
                'price' => 399,
                'lifetime' => 15,
                'internet_details' => 'NON-STOP INTERNET for 15GB at 5G/4G MAX SPEED',
                'call_credit' => 100,
                'call_credit_details' => 'for local and international calls',
                'free_call' => 'free',
                'free_call_details' => 'among TrueMove H numbers',
                'free_tiktok_details' => 'Free 10 GB',
                'unlimited_5g' => true,
                'free_wifi' => true,
                'free_tiktok' => true,
                'free_socials' => true,
                'benefit_ids' => '',
                'package_options' => ',399,', // package option 1:price, package option 2:price
                'thumbnail_link' => 'images/travel/Rectangle 709.png',
                'thumbnail_title' => '',
                'thumbnail_alt' => '',
                'recommended' => false,
                'priority' => 2,
                'language' => 'th',

                'details_content' => '<p>ซิมเทพ เล่นเน็ตไม่อั้น +โทรฟรีทุกค่าย  ลูกค้าจะได้เล่นเน็ตไม่จำกัด ฟรีเดือนแรก  โปรโมชั่นเครือข่าย True </p>

                                        <p>1. True ความเร็ว 10Mbps (ไม่ลดสปีด) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 210 บาท (รวมภาษีแล้ว) </p>

                                        <p>2. True ความเร็ว 20Mbps (ไม่มีโทรฟรี)  เล่นเน็ตไม่อั้น 70GB (FUP 1Mbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 200 บาท (รวมภาษีแล้ว) </p>

                                        <p>3. True ความเร็ว 15Mbps +โทรฟรีทุกค่าย  เล่นเน็ตไม่อั้น 80GB (FUP 1Mbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 300 บาท (รวมภาษีแล้ว) </p>

                                        <p>4. True ความเร็ว 15Mbps +โทรฟรีทุกค่าย  เล่นเน็ตไม่อั้น 55GB (FUP 1Mbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 250 บาท (รวมภาษีแล้ว)</p>

                                        <p> 5. True ความเร็ว 15Mbps +โทรฟรีทุกค่าย  เล่นเน็ตไม่อั้น 30GB (FUP 384Kbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 200 บาท (รวมภาษีแล้ว)</p>

                                        <p> 6. True ความเร็ว 4Mbps (ไม่มีโทรฟรี)  เล่นเน็ตไม่อั้น 30GB (FUP 1Mbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 150 บาท (รวมภาษีแล้ว) </p>

                                        <p>** ทำไมถึงต้องเลือกทรู ตอบ เล่นได้ทุกแอพ เน็ตไม่มีหมด 8 แอพดังนี้<br />
                                        เล่นโซเชียล Facebook, Line, instagram, TikTok</p>',

                'terms_content' => '<p><strong>ข้อกำหนดและเงื่อนไขรายการส่งเสริมการขาย Fixxy No Limit สำหรับย้ายค่ายแบบรายเดือน</strong></p>

                                        <p>1.รายการส่งเสริมการขายนี้ สำหรับผู้สมัครใช้บริการย้ายค่ายเบอร์เดิมมาใช้ ทรูมูฟ เอช (&ldquo;ผู้ใช้บริการ&rdquo;) ของบริษัท ทรู มูฟ เอช ยูนิเวอร์แซล คอมมิวนิเคชั่น จำกัด (&ldquo;บริษัท&rdquo;) แบบระบบรายเดือน ในนามบุคคลธรรมดา ตั้งแต่วันที่ 22 กันยายน 2566 &nbsp;ถึง 30 พฤศจิกายน 2566 หรือจนกว่าจะมีการเปลี่ยนแปลง</p>

                                        <p>2.รายละเอียดรายการส่งเสริมการขาย: อัตราค่าบริการยังไม่รวมภาษีมูลค่าเพิ่ม</p>

                                        <p>2.1 รายการส่งเสริมการขาย Fixxy No Limit 399<br />
                                        สิทธิตามแพ็กเกจปกติ:<br />
                                        คิดอัตราค่าใช้บริการเหมาจ่ายขั้นต่ำรายเดือน 399 บาท ต่อเดือน ผู้ใช้บริการจะได้รับสิทธิใช้บริการ ดังนี้<br />
                                        (1)โทรทุกเครือข่ายเดือนละ 150 นาทีต่อรอบค่าบริการ&nbsp;<br />
                                        (2)บริการ 5G ที่ความเร็วสูงสุด 20 เมกะบิตต่อวินาที (Mbps) เป็นจำนวน 70 กิกะไบต์ (GB)หลังจากนั้น จะใช้ได้ไม่จำกัดปริมาณที่ความเร็วสูงสุด 1 เมกะบิตต่อวินาที (Mbps)<br />
                                        (3)บริการ Wi-Fi ที่ความเร็วสูงสุด 1 กิกกะบิตต่อวินาที (Gbps) ไม่จำกัดปริมาณการใช้งาน<br />
                                        (4)บริการ Voice Mail และ Miss Call Alert</p>

                                        <p><br />
                                        เงื่อนไขการใช้รายการส่งเสริมการขาย<br />
                                        (1)บริษัทมีสิทธิในการจำกัดการใช้งานเน็ตไม่จำกัดปริมาณการใช้งานตามแพ็กเกจที่ผู้ใช้บริการได้สมัครใช้บริการควบคู่ไปกับเลขหมายโทรศัพท์เคลื่อนที่ และโทรศัพท์เคลื่อนที่ประเภท Smart phone และ Tablet หากบริษัทตรวจพบ หรือมีการแจ้งมายังบริษัท ว่าผู้ใช้บริการ มีการใช้งานในลักษณะของการกระจายสัญญาณโมบายอินเตอร์เน็ตให้กับโทรศัพท์เคลื่อนที่ และ/หรืออุปกรณ์อื่นเพื่อร่วมใช้งานด้วย และ/หรือการกระทำอื่นๆ ในลักษณะเดียวกัน หรือคล้ายคลึงกันทุกกรณี<br />
                                        <br />
                                        (2)บริษัทมีสิทธิในการจัดการบริหารเครือข่ายตามความเหมาะสมเพื่อรักษามาตรฐานคุณภาพของบริการ และเพื่อช่วยให้ผู้ใช้บริการโดยรวมสามารถใช้งานได้อย่างมีประสิทธิภาพ โดยการจำกัดปริมาณการใช้งานของผู้ใช้บริการและความเร็วของโมบายอินเตอร์เน็ตตามความเหมาะสมในรอบบิลถัดไป ในกรณีที่บริษัทพบหรือสันนิษฐานได้ว่าผู้ใช้บริการมีการดาวน์โหลด และ/หรือ อัพโหลดไฟล์ขนาดใหญ่ หรือ การใช้งานใดๆ ที่มีการรับส่งข้อมูลในปริมาณสูงมากอย่างต่อเนื่อง ในลักษณะไม่เป็นปกติดังเช่นบุคคลทั่วไปพึงใช้งาน หรือผู้ใช้บริการมีพฤฒิกรรมการใช้งานที่มีผลต่อการใช้บริการหรือเกิดความไม่เป็นธรรม ก่อหรืออาจก่อให้เกิดความเสียหาย หรือกระทบ หรืออาจจะกระทบต่อการใช้บริการผู้ใช้บริการรายอื่น และ/หรือต่อเครือข่าย หรือการให้บริการโดยรวมของบริษัท ทั้งนี้การลดความเร็วอาจลดต่ำกว่าที่ระบุในแพ็กเกจได้<br />
                                        <br />
                                        (3)บริษัทมีสิทธิ์จำกัดการใช้งานในลักษณะ BitTorrent, การแชร์เน็ตผ่าน Hotspot, การรับส่งไฟล์ระหว่างเครื่องลูกข่ายกับเครื่องลูกข่าย (Peer 2 Peer) เช่น แอปพลิเคชั่นกล้องวงจรปิด, เกมแบบหลายผู้เล่นบางเกม หรือการรับส่งข้อมูลในปริมาณสูงผิดปกติเกินบุคคลทั่วไปพึงใช้งาน หรือมีการใช้งานที่อาจส่งผลกระทบต่อการใช้งานโดยรวม<br />
                                        <br />
                                        เงื่อนไขการใช้บริการ TrueID: สามารถใช้บริการTrueID เฉพาะบริการภายในแอปพลิเคชั่น TrueID บนโทรศัพท์เคลื่อนที่หรือแท๊บเล็ต ในกรณีที่ผู้ใช้บริการใช้ website อื่นหรือลิงค์หรือการแชร์ที่ปรากฏบนหน้าแอปพลิเคชั่นTrueID ผู้ใช้บริการจะต้องชำระค่าใช้บริการเพิ่มเติม (ถ้ามี)ตามอัตราที่ระบุในแพ็กเกจที่ผู้ใช้บริการเลือกใช้งานอยู่ ณ ขณะนั้น หรือหากในแพ็กเกจที่เลือกใช้ ไม่ได้ระบุไว้ ให้คิดค่าบริการตามเงื่อนไขที่บริษัทกำหนด<br />
                                        <br />
                                        บริการที่รวมอยู่ในแพ็กเกจ TrueID ผู้ใช้สามารถใช้งาน login และ logout สามารถใช้บริการดูทีวีสตรีมมิ่ง, หนัง, เพลง, บทความ ผ่านเมนู Exclusive, Movie, TV, Soccer, Music, Sport, Travel, Food, Game, Men, Women และ Entertainment ไม่นับรวมในการใช้งานในเมนู Privileges, Cloud และ Payment<br />
                                        <br />
                                        3. ค่าบริการส่วนเกินเหมาจ่าย คิดเพิ่มเติมจากค่าใช้บริการเหมาจ่ายรายเดือน ในอัตราดังนี้<br />
                                        3.1 โทรทุกเครือข่าย นาทีละ 1.50 บาท คิดค่าบริการเป็นรายนาที เศษของนาทีนับเป็นหนึ่งนาที<br />
                                        3.2 บริการส่งข้อความสั้น (SMS) ระหว่างโทรศัพท์เคลื่อนที่ที่ใช้และจดทะเบียนภายในประเทศ ข้อความละ 2.50 บาท<br />
                                        3.3 บริการส่งข้อความมัลติมีเดีย (MMS) ระหว่างโทรศัพท์เคลื่อนทีที่ใช้และจดทะเบียนภายในประเทศ ครั้งละ 4.50 บาท</p>',
            ],
            [
                'travel_cate_id' => 2,
                'title' => 'Thailand Tourist sim',
                'details' => 'Thailand Tourist sim',
                'price' => 499,
                'lifetime' => 15,
                'internet_details' => 'NON-STOP INTERNET for 15GB at 5G/4G MAX SPEED',
                'call_credit' => 100,
                'call_credit_details' => 'for local and international calls',
                'free_call' => 'Unlimited call',
                'free_call_details' => 'among TrueMove H numbers',
                'free_tiktok_details' => 'Free 10 GB',
                'unlimited_5g' => true,
                'free_wifi' => true,
                'free_tiktok' => true,
                'free_socials' => true,
                'benefit_ids' => '',
                'package_options' => ',499,', // package option 1:price, package option 2:price
                'thumbnail_link' => 'images/travel/Rectangle 709.png',
                'thumbnail_title' => '',
                'thumbnail_alt' => '',
                'recommended' => false,
                'priority' => 3,
                'language' => 'th',

                'details_content' => '<p>ซิมเทพ เล่นเน็ตไม่อั้น +โทรฟรีทุกค่าย  ลูกค้าจะได้เล่นเน็ตไม่จำกัด ฟรีเดือนแรก  โปรโมชั่นเครือข่าย True </p>

                                        <p>1. True ความเร็ว 10Mbps (ไม่ลดสปีด) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 210 บาท (รวมภาษีแล้ว) </p>

                                        <p>2. True ความเร็ว 20Mbps (ไม่มีโทรฟรี)  เล่นเน็ตไม่อั้น 70GB (FUP 1Mbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 200 บาท (รวมภาษีแล้ว) </p>

                                        <p>3. True ความเร็ว 15Mbps +โทรฟรีทุกค่าย  เล่นเน็ตไม่อั้น 80GB (FUP 1Mbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 300 บาท (รวมภาษีแล้ว) </p>

                                        <p>4. True ความเร็ว 15Mbps +โทรฟรีทุกค่าย  เล่นเน็ตไม่อั้น 55GB (FUP 1Mbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 250 บาท (รวมภาษีแล้ว)</p>

                                        <p> 5. True ความเร็ว 15Mbps +โทรฟรีทุกค่าย  เล่นเน็ตไม่อั้น 30GB (FUP 384Kbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 200 บาท (รวมภาษีแล้ว)</p>

                                        <p> 6. True ความเร็ว 4Mbps (ไม่มีโทรฟรี)  เล่นเน็ตไม่อั้น 30GB (FUP 1Mbps) &quot;ฟรีเดือนแรก&quot;  เดือนต่อไป เติมเงิน 150 บาท (รวมภาษีแล้ว) </p>

                                        <p>** ทำไมถึงต้องเลือกทรู ตอบ เล่นได้ทุกแอพ เน็ตไม่มีหมด 8 แอพดังนี้<br />
                                        เล่นโซเชียล Facebook, Line, instagram, TikTok</p>',

                'terms_content' => '<p><strong>ข้อกำหนดและเงื่อนไขรายการส่งเสริมการขาย Fixxy No Limit สำหรับย้ายค่ายแบบรายเดือน</strong></p>

                                        <p>1.รายการส่งเสริมการขายนี้ สำหรับผู้สมัครใช้บริการย้ายค่ายเบอร์เดิมมาใช้ ทรูมูฟ เอช (&ldquo;ผู้ใช้บริการ&rdquo;) ของบริษัท ทรู มูฟ เอช ยูนิเวอร์แซล คอมมิวนิเคชั่น จำกัด (&ldquo;บริษัท&rdquo;) แบบระบบรายเดือน ในนามบุคคลธรรมดา ตั้งแต่วันที่ 22 กันยายน 2566 &nbsp;ถึง 30 พฤศจิกายน 2566 หรือจนกว่าจะมีการเปลี่ยนแปลง</p>

                                        <p>2.รายละเอียดรายการส่งเสริมการขาย: อัตราค่าบริการยังไม่รวมภาษีมูลค่าเพิ่ม</p>

                                        <p>2.1 รายการส่งเสริมการขาย Fixxy No Limit 399<br />
                                        สิทธิตามแพ็กเกจปกติ:<br />
                                        คิดอัตราค่าใช้บริการเหมาจ่ายขั้นต่ำรายเดือน 399 บาท ต่อเดือน ผู้ใช้บริการจะได้รับสิทธิใช้บริการ ดังนี้<br />
                                        (1)โทรทุกเครือข่ายเดือนละ 150 นาทีต่อรอบค่าบริการ&nbsp;<br />
                                        (2)บริการ 5G ที่ความเร็วสูงสุด 20 เมกะบิตต่อวินาที (Mbps) เป็นจำนวน 70 กิกะไบต์ (GB)หลังจากนั้น จะใช้ได้ไม่จำกัดปริมาณที่ความเร็วสูงสุด 1 เมกะบิตต่อวินาที (Mbps)<br />
                                        (3)บริการ Wi-Fi ที่ความเร็วสูงสุด 1 กิกกะบิตต่อวินาที (Gbps) ไม่จำกัดปริมาณการใช้งาน<br />
                                        (4)บริการ Voice Mail และ Miss Call Alert</p>

                                        <p><br />
                                        เงื่อนไขการใช้รายการส่งเสริมการขาย<br />
                                        (1)บริษัทมีสิทธิในการจำกัดการใช้งานเน็ตไม่จำกัดปริมาณการใช้งานตามแพ็กเกจที่ผู้ใช้บริการได้สมัครใช้บริการควบคู่ไปกับเลขหมายโทรศัพท์เคลื่อนที่ และโทรศัพท์เคลื่อนที่ประเภท Smart phone และ Tablet หากบริษัทตรวจพบ หรือมีการแจ้งมายังบริษัท ว่าผู้ใช้บริการ มีการใช้งานในลักษณะของการกระจายสัญญาณโมบายอินเตอร์เน็ตให้กับโทรศัพท์เคลื่อนที่ และ/หรืออุปกรณ์อื่นเพื่อร่วมใช้งานด้วย และ/หรือการกระทำอื่นๆ ในลักษณะเดียวกัน หรือคล้ายคลึงกันทุกกรณี<br />
                                        <br />
                                        (2)บริษัทมีสิทธิในการจัดการบริหารเครือข่ายตามความเหมาะสมเพื่อรักษามาตรฐานคุณภาพของบริการ และเพื่อช่วยให้ผู้ใช้บริการโดยรวมสามารถใช้งานได้อย่างมีประสิทธิภาพ โดยการจำกัดปริมาณการใช้งานของผู้ใช้บริการและความเร็วของโมบายอินเตอร์เน็ตตามความเหมาะสมในรอบบิลถัดไป ในกรณีที่บริษัทพบหรือสันนิษฐานได้ว่าผู้ใช้บริการมีการดาวน์โหลด และ/หรือ อัพโหลดไฟล์ขนาดใหญ่ หรือ การใช้งานใดๆ ที่มีการรับส่งข้อมูลในปริมาณสูงมากอย่างต่อเนื่อง ในลักษณะไม่เป็นปกติดังเช่นบุคคลทั่วไปพึงใช้งาน หรือผู้ใช้บริการมีพฤฒิกรรมการใช้งานที่มีผลต่อการใช้บริการหรือเกิดความไม่เป็นธรรม ก่อหรืออาจก่อให้เกิดความเสียหาย หรือกระทบ หรืออาจจะกระทบต่อการใช้บริการผู้ใช้บริการรายอื่น และ/หรือต่อเครือข่าย หรือการให้บริการโดยรวมของบริษัท ทั้งนี้การลดความเร็วอาจลดต่ำกว่าที่ระบุในแพ็กเกจได้<br />
                                        <br />
                                        (3)บริษัทมีสิทธิ์จำกัดการใช้งานในลักษณะ BitTorrent, การแชร์เน็ตผ่าน Hotspot, การรับส่งไฟล์ระหว่างเครื่องลูกข่ายกับเครื่องลูกข่าย (Peer 2 Peer) เช่น แอปพลิเคชั่นกล้องวงจรปิด, เกมแบบหลายผู้เล่นบางเกม หรือการรับส่งข้อมูลในปริมาณสูงผิดปกติเกินบุคคลทั่วไปพึงใช้งาน หรือมีการใช้งานที่อาจส่งผลกระทบต่อการใช้งานโดยรวม<br />
                                        <br />
                                        เงื่อนไขการใช้บริการ TrueID: สามารถใช้บริการTrueID เฉพาะบริการภายในแอปพลิเคชั่น TrueID บนโทรศัพท์เคลื่อนที่หรือแท๊บเล็ต ในกรณีที่ผู้ใช้บริการใช้ website อื่นหรือลิงค์หรือการแชร์ที่ปรากฏบนหน้าแอปพลิเคชั่นTrueID ผู้ใช้บริการจะต้องชำระค่าใช้บริการเพิ่มเติม (ถ้ามี)ตามอัตราที่ระบุในแพ็กเกจที่ผู้ใช้บริการเลือกใช้งานอยู่ ณ ขณะนั้น หรือหากในแพ็กเกจที่เลือกใช้ ไม่ได้ระบุไว้ ให้คิดค่าบริการตามเงื่อนไขที่บริษัทกำหนด<br />
                                        <br />
                                        บริการที่รวมอยู่ในแพ็กเกจ TrueID ผู้ใช้สามารถใช้งาน login และ logout สามารถใช้บริการดูทีวีสตรีมมิ่ง, หนัง, เพลง, บทความ ผ่านเมนู Exclusive, Movie, TV, Soccer, Music, Sport, Travel, Food, Game, Men, Women และ Entertainment ไม่นับรวมในการใช้งานในเมนู Privileges, Cloud และ Payment<br />
                                        <br />
                                        3. ค่าบริการส่วนเกินเหมาจ่าย คิดเพิ่มเติมจากค่าใช้บริการเหมาจ่ายรายเดือน ในอัตราดังนี้<br />
                                        3.1 โทรทุกเครือข่าย นาทีละ 1.50 บาท คิดค่าบริการเป็นรายนาที เศษของนาทีนับเป็นหนึ่งนาที<br />
                                        3.2 บริการส่งข้อความสั้น (SMS) ระหว่างโทรศัพท์เคลื่อนที่ที่ใช้และจดทะเบียนภายในประเทศ ข้อความละ 2.50 บาท<br />
                                        3.3 บริการส่งข้อความมัลติมีเดีย (MMS) ระหว่างโทรศัพท์เคลื่อนทีที่ใช้และจดทะเบียนภายในประเทศ ครั้งละ 4.50 บาท</p>',
            ],
        ]);
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        Schema::dropIfExists('travel_sims');
    }
};
